NextFOAM-2501/tutorials/heatTransfer/chtMultiRegionTwoPhaseEulerFoam/solidQuenching2D/constant/water/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

limitTLiq
{
    type       limitTemperature;
    min        300;
    max        2000;
    selectionMode all;
    phase       liquid;
    active      yes;
}

limitTGas
{
    type       limitTemperature;
    min        300;
    max        2000;
    selectionMode all;
    phase       gas;
    active      yes;
}


// ************************************************************************* //
